docs/food/rasam.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rasam</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./"> UP </a>
 |
 <a accesskey="H" href="../.."> HOME </a>
</div><div id="content" class="content">

<div id="outline-container-orgbe7e061" class="outline-2">
<h2 id="orgbe7e061">Rasam</h2>
<div class="outline-text-2" id="text-orgbe7e061">
</div>
<div id="outline-container-org75e383d" class="outline-3">
<h3 id="org75e383d">Prep</h3>
<div class="outline-text-3" id="text-org75e383d">
<ul class="org-ul">
<li>1/3 cup toor dal</li>
</ul>



<ul class="org-ul">
<li>1 tbsp tamarind paste</li>
<li>roughly 5 sprigs curry leaves</li>
<li>1-2 tomatoes, chopped or quartered</li>
</ul>


<ul class="org-ul">
<li>1-2 tsp each of asafoetida, turmeric</li>
<li>This ratio of spices = 1 red chilli powder : 1.5 coriander : 2 cumin : 1 black pepper. How much of
each you add is based on personal preference. Mine is at least 3 tsp of rcp.</li>
<li>cilantro, chopped</li>
</ul>


<p>
The measurements of spices here are ultimately based on personal preference.
</p>
</div>
</div>


<div id="outline-container-org81e35cd" class="outline-3">
<h3 id="org81e35cd">Cook</h3>
<div class="outline-text-3" id="text-org81e35cd">
<ol class="org-ol">
<li>Cook toor dal in instant pot. Roughly a 1:3 dal:water ratio.</li>
<li>Soak 1 tbsp of puli (tamarind) paste in water for about 10-15 minutes.</li>
<li>Set the water on stove, and add chopped tomatoes and curry leaves. Optionally, can add garlic cloves. Bring this water to a boil.</li>
<li>Add in asafoetida, turmeric, salt to taste.</li>
<li>Add in red chilli powder, coriander, cumin, black pepper.</li>
<li>Allow the spiced water to boil. Add the cooked toor dal in small increments, until the preferred thickness is achieved.</li>
<li>Let boil for another 10-15 minutes, and add chopped cilantro. Add salt to taste.</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
